## 05 판다스를 활용한 데이터 이해

### 02 판다스의 기본 자료형 알아보기

### 리스트

In [4]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])
print(myfood[1:3]) # 첫번째 두번째 가져오기

banana
apple
candy
['apple', 'candy']

In [6]:
for item in myfood:
    print(item)

banana
apple
candy

### 딕셔너리

In [7]:
dict1 = {'one':'하나', 'two':"둘", 'three':'셋'}
dict2 = {1:"하나", 2:"둘", 3:"셋"}
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [8]:
print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

In [9]:
print(dict1['one'])
print(dict2[2])
print(dict3['col2'])

하나
둘
['a', 'b', 'c']

### 판다스 모듈 불러오기

In [10]:
import pandas as pd # pandas 를 불러오고 밑에서 이를 pd 약자로서 쓰겠다.

In [11]:
from pandas import Series, DataFrame # pandas안의 Series와 DataFrame를 불러옴.

In [12]:
print("pandas 버전 : ", pd.__version__)

pandas 버전 :  1.1.3

### 홍길동 팀별 대항 게임 5일간의 점수
### [1000, 14000, 3000, 3000, 1000]

In [13]:
score = Series( [1000, 14000, 3000, 3000, 1000] )
print(score)
print("자료형 확인 : ", type(score))

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64
자료형 확인 :  <class 'pandas.core.series.Series'>

In [14]:
## Series 인덱스 확인
print(score.index)
# 인덱스를 리스트 자료형으로 변경 후, 확인하기
print(list(score.index))
## Series 값 확인
print(score.values)
## Series 값 자료형 확인
print(score.dtype)

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000  3000  1000]
int64

### 판다스 시리즈 인덱스 지정

In [15]:
### 인덱스(index) 속성 이용
score = Series( [1000, 14000, 3000],
index = ['2019-05-01', '2019-05-02', '2019-05-03'] )
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [16]:
print(score['2019-05-01']) # 인덱스 이용 - 5월 1일 날짜 점수 확인
print("-------------")
print(score['2019-05-02':'2019-05-03']) # 5월 2일, 3일 날짜 팀 점수 확인

1000
-------------
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [17]:
for idx in score.index:
    print(idx)

2019-05-01
2019-05-02
2019-05-03

In [18]:
for value in score.values:
    print(value)

1000
14000
3000

#### 5-3 pandas의 Series자료형 만들어보기 - 나의 일주일 계획.

In [20]:
fruit = Series( ['체리', '메론', '망고', '파인애플','사과','거봉','오렌지'],
index = ['월', '화', '수','목','금','토','일'] )
print(fruit)

월      체리
화      메론
수      망고
목    파인애플
금      사과
토      거봉
일     오렌지
dtype: object

In [22]:
print(fruit['월':'수'])

월    체리
화    메론
수    망고
dtype: object

In [26]:
fruit[0:3]

월    체리
화    메론
수    망고
dtype: object

### iloc접근

In [27]:
fruit.iloc[0:3]

월    체리
화    메론
수    망고
dtype: object

In [30]:
fruit.values
fruit.index

Index(['월', '화', '수', '목', '금', '토', '일'], dtype='object')

In [23]:
idx=pd.date_range(start='2021-06-21',end='2021-06-24')
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24'], dtype='datetime64[ns]', freq='D')

### 두 팀의 팀점수 합산해보기
* 길동팀의 3일간의 점수와 toto 팀의 3일간의 점수

In [31]:
from pandas import Series

In [32]:
gildong = Series([1500, 3000, 2500],
                 index = ['2019-05-01', '2019-05-02', '2019-05-03'] )
toto = Series([3000, 3000, 2000],
              index = ['2019-05-01', '2019-05-03', '2019-05-02'] )

In [33]:
gildong + toto

2019-05-01    4500
2019-05-02    5000
2019-05-03    5500
dtype: int64

### 03 데이터 프레임의 이해
* 데이터 프레임의 객체를 생성하는 가장 간단한 방법은 딕셔너리를 이용하는 방법
* 데이터 프레임은 Series의 결합으로 이루어진 것으로 생각할 수 있음.
* Pandas(판다스)의 대표적인 기본 자료형이다.
* DataFrame 함수를 이용하여 객체 생성이 가능하다.

In [34]:
from pandas import DataFrame

In [35]:
dat = { 'col1' : [1,2,3,4],
'col2' : [10,20,30,40],
'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

### 네 팀의 5일간의 팀별 점수
* 팀은 toto, gildong, apple, catanddog 팀이다.

In [36]:
from pandas import DataFrame
team_score = { "toto":[1500,3000,5000,7000,5500],
"apple":[4000,5000,6000,5500,4500],
"gildong":[2000,2500,3000,4000,3000],
"catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score)
team_df
#개수가 맞지 않으면 에러가남.

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [43]:
idx = pd.date_range(start='2021-06-21', end='2021-06-25')
#date = ['19-05-01','19-05-02', '19-05-03', '19-05-04', '19-05-05']
team_df = DataFrame(team_score,
columns=['catanddog', 'toto', 'apple', 'gildong'],
index=idx)
team_df

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [44]:
print(team_df.loc[:,'toto']) #loc는 인덱스로 접근

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [46]:
#열 인덱스
team_df.columns

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')

In [49]:
#행인덱스
team_df.index

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [53]:
#toto열 가져오기
team_df.loc[:,'toto']

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [54]:
#toto열과 apple열 가져오기
team_df.loc[:,'toto':'apple']

            toto  apple
2021-06-21  1500   4000
2021-06-22  3000   5000
2021-06-23  5000   6000
2021-06-24  7000   5500
2021-06-25  5500   4500

In [56]:
team_df.loc['2021-06-21',:]

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 2021-06-21 00:00:00, dtype: int64

In [57]:
type(team_df.loc['2021-06-21',:])

pandas.core.series.Series

In [58]:
team_df.iloc[3,:]

catanddog    5000
toto         7000
apple        5500
gildong      4000
Name: 2021-06-24 00:00:00, dtype: int64

In [60]:
team_df['toto']

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [62]:
team_df[['toto','apple']]

            toto  apple
2021-06-21  1500   4000
2021-06-22  3000   5000
2021-06-23  5000   6000
2021-06-24  7000   5500
2021-06-25  5500   4500

### loc와 iloc를 이용한 접근
* loc는 데이터 프레임의 컬럼명(인덱스)를 사용하여 데이터 추출한다.
* iloc는 데이터 프레임의 데이터 순서(번호)를 사용하여 데이터 추출(시작번호 : 0)
* loc[ 행, 열] 접근이라고 쉽게 생각한다.

#### loc를 이용한 열에 접근

In [63]:
## 컬럼명 확인
print(team_df.columns)
print("-----")
print(team_df.loc[:, 'toto']) # 전체행, toto팀
print("-----")
print(team_df.loc[:, ['toto', 'gildong'] ]) # 전체행, toto, gildong팀
print("-----")
print(team_df.loc[:, 'toto': ]) # 전체행, toto 부터 끝까지

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')
-----
2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64
-----
            toto  gildong
2021-06-21  1500     2000
2021-06-22  3000     2500
2021-06-23  5000     3000
2021-06-24  7000     4000
2021-06-25  5500     3000
-----
            toto  apple  gildong
2021-06-21  1500   4000     2000
2021-06-22  3000   5000     2500
2021-06-23  5000   6000     3000
2021-06-24  7000   5500     4000
2021-06-25  5500   4500     3000

#### iloc 속성을 이용한 행, 열 데이터 접근하기

In [64]:
print(team_df.iloc[0]) # 첫번째 행 접근
print("------")
print(team_df.iloc[ [0,1] ]) # 첫번째 두번째 행 접근
print("------")
print(team_df.iloc[ 0:3:1] ) # 첫번째부터 세번째 행 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[ range_num ] ) # 첫번째부터 세번째 행 접근

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 2021-06-21 00:00:00, dtype: int64
------
            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
------
            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
------
            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000

In [65]:
print(team_df.iloc[:, 0]) # 첫번째 열 접근
print("------")
print(team_df.iloc[:, [0,1] ]) # 첫번째 두번째 열 접근
print("------")
print(team_df.iloc[:, 0:3:1] ) # 첫번째부터 세번째 열 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[:, range_num ] ) # 첫번째부터 세번째 열 접근

2021-06-21    7000
2021-06-22    5000
2021-06-23    3000
2021-06-24    5000
2021-06-25    4000
Freq: D, Name: catanddog, dtype: int64
------
            catanddog  toto
2021-06-21       7000  1500
2021-06-22       5000  3000
2021-06-23       3000  5000
2021-06-24       5000  7000
2021-06-25       4000  5500
------
            catanddog  toto  apple
2021-06-21       7000  1500   4000
2021-06-22       5000  3000   5000
2021-06-23       3000  5000   6000
2021-06-24       5000  7000   5500
2021-06-25       4000  5500   4500
------
            catanddog  toto  apple
2021-06-21       7000  1500   4000
2021-06-22       5000  3000   5000
2021-06-23       3000  5000   6000
2021-06-24       5000  7000   5500
2021-06-25       4000  5500   4500

In [69]:
#새로운 컬럼 추가
team_df['rowsum']=team_df.sum(axis=1)
team_df

            catanddog  toto  apple  gildong  rowsum
2021-06-21       7000  1500   4000     2000   29000
2021-06-22       5000  3000   5000     2500   31000
2021-06-23       3000  5000   6000     3000   34000
2021-06-24       5000  7000   5500     4000   43000
2021-06-25       4000  5500   4500     3000   34000

#### 팀별 총합 및 평균 등의 통계는 얼마나 될까?/

In [72]:
#실습1-1
from pandas import DataFrame
data = { "순위":[1,2,3,4],
        "연속":[2,1,1,1],
        "누적":[2,3,2,4],
        "종목명":["솔고바이오", "한세엠케이", "네오오토", "엄지하우스"],
        "현재가":[993,9490,9990,4885],
        "전일비":[229,2190,2300,635],
        "등락률":[29.97,30.00,29.91,14.94],
        "거래량":[4657527,19568672,3167505,7231]}
data_df = DataFrame(data)
data_df
#개수가 맞지 않으면 에러가남.

   순위  연속  누적    종목명   현재가   전일비    등락률       거래량
0   1   2   2  솔고바이오   993   229  29.97   4657527
1   2   1   3  한세엠케이  9490  2190  30.00  19568672
2   3   1   2   네오오토  9990  2300  29.91   3167505
3   4   1   4  엄지하우스  4885   635  14.94      7231

In [82]:
#실습1-2
idx = pd.date_range(start='2021-06-21', end='2021-06-24')
data_df = DataFrame(data,
columns=['순위','연속','누적','종목명','현재가','전일비','등락률','거래량'],
index=idx)
data_df

            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-21   1   2   2  솔고바이오   993   229  29.97   4657527
2021-06-22   2   1   3  한세엠케이  9490  2190  30.00  19568672
2021-06-23   3   1   2   네오오토  9990  2300  29.91   3167505
2021-06-24   4   1   4  엄지하우스  4885   635  14.94      7231

In [87]:
#실습1-3
print(data_df.iloc[ [3] ]) 
print("_________________")
print(data_df.iloc[ [0,1] ])

            순위  연속  누적    종목명   현재가  전일비    등락률   거래량
2021-06-24   4   1   4  엄지하우스  4885  635  14.94  7231
_________________
            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-21   1   2   2  솔고바이오   993   229  29.97   4657527
2021-06-22   2   1   3  한세엠케이  9490  2190  30.00  19568672

In [88]:
#실습1-4
print(data_df.loc['2021-06-22':'2021-06-23',:])
print("_________________")
print(data_df.loc['2021-06-24':,:])

            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-22   2   1   3  한세엠케이  9490  2190  30.00  19568672
2021-06-23   3   1   2   네오오토  9990  2300  29.91   3167505

In [94]:
#실습1-5
print(data_df.loc['2021-06-22':'2021-06-23','연속':'누적'])

            연속  누적
2021-06-22   1   3
2021-06-23   1   2

In [ ]:
#실습1-1
from pandas import DataFrame
data = { "순위":[1,2,3,4],
        "연속":[2,1,1,1],
        "누적":[2,3,2,4],
        "종목명":["솔고바이오", "한세엠케이", "네오오토", "엄지하우스"],
        "현재가":[993,9490,9990,4885],
        "전일비":[229,2190,2300,635],
        "등락률":[29.97,30.00,29.91,14.94],
        "거래량":[4657527,19568672,3167505,7231]}
data_df = DataFrame(data)
data_df
#개수가 맞지 않으면 에러가남.
#실습1-2
idx = pd.date_range(start='2021-06-21', end='2021-06-24')
data_df = DataFrame(data,
columns=['순위','연속','누적','종목명','현재가','전일비','등락률','거래량'],
index=idx)
data_df
#실습1-3
print(data_df.iloc[ [3] ]) 
print("_________________")
print(data_df.iloc[ [0,1] ]) 
#실습1-4
print(data_df.loc['2021-06-22':'2021-06-23',:])
print("_________________")
print(data_df.loc['2021-06-24':,:])
#실습1-5
print(data_df.loc['2021-06-22':'2021-06-23','연속':'누적'])